## Advanced Dataframes

In this lesson we will continue working with pandas dataframes, and explore some more complex dataframe manipulations.

In [2]:
%matplotlib inline
import pandas as pd
import numpy as np

np.random.seed(123)

students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

# randomly generate scores for each student for each subject
# note that all the values need to have the same length here
math_grades = np.random.randint(low=60, high=100, size=len(students))
english_grades = np.random.randint(low=60, high=100, size=len(students))
reading_grades = np.random.randint(low=60, high=100, size=len(students))

df = pd.DataFrame({'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades,
                   'classroom': np.random.choice(['A', 'B'], len(students))})

### Creating Dataframes

#### From Lists and Dictionaries

There are several ways to create dataframes, we've already seen how we can create a dataframe from a dictionary:

In [3]:
pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})

   A  B
0  1  4
1  2  5
2  3  6

The keys in the passed dictionary will be the column names, and the values are the data points that make up each column.

We can also create dataframes from a 2d data structure, either a numpy array or a list of lists:

In [4]:
pd.DataFrame([[1, 2, 3], [4, 5, 6]])

   0  1  2
0  1  2  3
1  4  5  6

In [23]:
data = np.array([[1, 2, 3], [4, 5, 6]])

pd.DataFrame(data, columns=['a', 'b', 'c'])

   a  b  c
0  1  2  3
1  4  5  6

Notice here that we had to specify the names of the columns ourselves.

### Importing and manipulating csv file

In [5]:
df = pd.read_csv("school_census_data_18.csv")

In [7]:
df.head()

,Country,Region,DataYear,ClassGrade,Gender,Ageyears,Handed,Height_cm,Footlength_cm,Armspan_cm,...,Watching_TV_Hours,Paid_Work_Hours,Work_At_Home_Hours,Schoolwork_Pressure,Planned_Education_Level,Favorite_Music,Superpower,Preferred_Status,Role_Model_Type,Charity_Donation
0,USA,TX,2018,12,Female,17.0,Right-Handed,152,22.5,24,...,0.0,35.0,1.0,Very little,Graduate degree,Rap/Hip hop,Invisibility,Happy,Business person,Environment
1,USA,TN,2018,12,Male,18.0,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,USA,CO,2018,12,Female,17.0,Ambidextrous,164cm,22cm,160cm,...,6.0,2.0,2.0,Some,Graduate degree,Rap/Hip hop,Invisibility,Happy,Friend,International aid
3,USA,ID,2018,12,Male,23.0,Right-Handed,171.5,21.6,162.5,...,2.0,0.0,8.0,A lot,Graduate degree,Gospel,Freeze time,Happy,Relative,Religious
4,USA,NC,2018,12,Female,17.0,Right-Handed,136,26,54,...,0.0,2.0,2.0,A lot,Undergraduate degree,Rap/Hip hop,Freeze time,Happy,Relative,International aid

In [17]:
df[["Handed","Gender"]][df.Handed == "Left-Handed"].sort_values(by="Gender")

         Handed  Gender
20  Left-Handed  Female
69  Left-Handed  Female
73  Left-Handed  Female
98  Left-Handed  Female
9   Left-Handed    Male
13  Left-Handed    Male
23  Left-Handed    Male
34  Left-Handed    Male
54  Left-Handed    Male
79  Left-Handed    Male
89  Left-Handed    Male
99  Left-Handed    Male

### From Text Files

The most commonly used function to data from an external text file is read_csv. Two other commonly used functions are read_table, for less structured files that are still tabular, and read_json, for data stored as JSON.

There are many other read_ functions, but read_csv will be the most commonly used one.

See the documentation for the individual functions for customizing how the data is read into a dataframe.

### From SQL

We can use the read_sql method to create a dataframe based on the results of a SQL query. To do this, we need to tell pandas how to connect to the database we are querying. The way we communicate this to pandas is with a specially formatted connection string.

In addition, whenever we want to connect to a database from our python code (other programming languages are similar), we will need a driver, a bit of software that handles the details of the database connection.

In order to connect to mysql, we'll install the mysqlclient and pymysql driver packages: python -m pip install mysqlclient pymysql Once those are installed, we can create the connection string. In general, database connection urls will have this format:

In [19]:
# protocol://[user[:password]@]hostname/[database_name]

Here's an example of what one would look like:

In [21]:
#mysql+pymysql://codeup:p@assw0rd@123.123.123.123/some_db

Another thing we need to consider is that we don't want to publish our database credentials to github, however, we will need access to these values in our code in order to create the connection string defined above.

In order to accomplish this, we can define several variables in a file named env.py that contain the sensitive data, add env.py to our .gitignore file, and then import those values into another script.

In [22]:
# from env import host, user, password

# url = f'mysql+pymysql://{user}:{password}@{host}/employees'

Once this url is defined, we can use it with the read_sql function to have pandas treat the results of a SQL query as a dataframe.

In [25]:
# pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)